'''
Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
Каждое число вводится с новой строки.
Ввод:
7 2 5
Вывод:
7 9 11 13 15
'''

# def fillArray(firstNum = int(input("Первый член последовательности: ")), dif = int(input("Разность элементов: ")), length = int(input("Длина последовательности: "))):
#     array = [firstNum]
#     for i in range(1,length):
#         array.append(array[i-1] + dif)
#     return array

# print(*fillArray())

